AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ЗаписатьДанныеВXMLФайл/Ext/Module.bsl
Функция ЗаписатьОстаткиВXMLФайл () Экспорт
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|  ОстаткиОстатки.КоличествоОстаток КАК Остаток,
		|  ПРЕДСТАВЛЕНИЕ(ОстаткиОстатки.Товар) КАК Товар
		|ИЗ
		|  РегистрНакопления.Остатки.Остатки(&Дата) КАК ОстаткиОстатки";
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();  
		
		Дата = Формат(ТекущаяДата(), "ДФ=дд.ММ.гг_ЧЧ.мм.сс");
		ПутьКФайлу = "C:\1C\MyBases\ВыгрузкаОтчетов\Остатки"+Дата+".xml";
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ПутьКФайлу, "UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
		
		
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл 
			Количество = Строка(ВыборкаРезультатаЗапроса.Остаток);
			Товар = ВыборкаРезультатаЗапроса.Товар;  
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Товар"); 
			ЗаписьXML.ЗаписатьАтрибут("Товар", Товар);
			ЗаписьXML.ЗаписатьАтрибут("Количество", Количество);
			ЗаписьXML.ЗаписатьКонецЭлемента(); 			
		КонецЦикла; 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();

		
	КонецФункции
